tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Improved top (interactive process viewer)
brew "htop"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# HTTP benchmarking tool
brew "wrk"
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"
# HTTP and GraphQL Client
cask "insomnia"
# Trims video and audio files losslessly
cask "losslesscut"
# Archive manager for data compression and backups
cask "rar"
# Text editor for code, markup and prose
cask "sublime-text"
vscode "bradlc.vscode-tailwindcss"
vscode "britesnow.vscode-toggle-quotes"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "foxundermoon.shell-format"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "natqe.reload"
vscode "omthemes.omthemes"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-portuguese-brazilian"
vscode "undefined_publisher.clsxify-transformer"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
